<html xmlns:ng="http://docbook.org/docbook-ng"><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Documentation project Saper</title><meta name="generator" content="DocBook XSL Stylesheets V1.79.2"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="article"><div class="titlepage"><div><div><h1 class="title"><a name="d5e1"></a>Documentation project Saper</h1></div><div><div class="author"><h3 class="author"><span class="firstname">Alexander</span> <span class="surname">Semik</span></h3></div></div><div><p class="copyright">Copyright &copy; 2019 Alexander Semik</p></div></div><hr></div><div class="part"><div class="titlepage"><div><div><h1 class="title"><a name="d5e11"></a>Part&nbsp;I.&nbsp;Documentation project</h1></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl class="toc"><dt><span class="chapter"><a href="#d5e13">1. Project description</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e16">How to play</a></span></dt></dl></dd><dt><span class="chapter"><a href="#d5e25">2. Realization details</a></span></dt><dd><dl><dt><span class="section"><a href="#d5e27">Code win game</a></span></dt><dt><span class="section"><a href="#d5e30">Init after load page.</a></span></dt></dl></dd></dl></div><div class="chapter"><div class="titlepage"><div><div><h2 class="title"><a name="d5e13"></a>Chapter&nbsp;1.&nbsp;Project description</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl class="toc"><dt><span class="section"><a href="#d5e16">How to play</a></span></dt></dl></div><p>"&#1064;&#1072;&#1096;&#1082;&#1080;" (eng. "Checkers") - &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1085;&#1072;&#1103; &#1080;&#1075;&#1088;&#1072;.</p><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e16"></a>How to play</h2></div></div></div><p>&#1064;&#1072;&#1096;&#1082;&#1080; &#8212; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1085;&#1072;&#1103; &#1080;&#1075;&#1088;&#1072; &#1076;&#1083;&#1103; &#1076;&#1074;&#1091;&#1093; &#1080;&#1075;&#1088;&#1086;&#1082;&#1086;&#1074;, &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1097;&#1072;&#1103;&#1089;&#1103; &#1074; &#1087;&#1077;&#1088;&#1077;&#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1092;&#1080;&#1096;&#1077;&#1082;-&#1096;&#1072;&#1096;&#1077;&#1082; &#1087;&#1086; &#1082;&#1083;&#1077;&#1090;&#1082;&#1072;&#1084; &#1096;&#1072;&#1096;&#1077;&#1095;&#1085;&#1086;&#1081; &#1076;&#1086;&#1089;&#1082;&#1080;.</p><p>&#1042;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1087;&#1072;&#1088;&#1090;&#1080;&#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084;&#1091; &#1080;&#1075;&#1088;&#1086;&#1082;&#1091; &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1090; &#1096;&#1072;&#1096;&#1082;&#1080; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1094;&#1074;&#1077;&#1090;&#1072;: &#1095;&#1105;&#1088;&#1085;&#1086;&#1075;&#1086; &#1080;&#1083;&#1080; &#1073;&#1077;&#1083;&#1086;&#1075;&#1086; (&#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;, &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093;, &#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1105;&#1084;&#1085;&#1099;&#1084;, &#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#8212; &#1089;&#1074;&#1077;&#1090;&#1083;&#1099;&#1084;).</p><p>&#1062;&#1077;&#1083;&#1100; &#1080;&#1075;&#1088;&#1099; &#8212; &#1074;&#1079;&#1103;&#1090;&#1100; &#1074;&#1089;&#1077; &#1096;&#1072;&#1096;&#1082;&#1080; &#1089;&#1086;&#1087;&#1077;&#1088;&#1085;&#1080;&#1082;&#1072; &#1080;&#1083;&#1080; &#1083;&#1080;&#1096;&#1080;&#1090;&#1100; &#1080;&#1093; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1093;&#1086;&#1076;&#1072; (&#1079;&#1072;&#1087;&#1077;&#1088;&#1077;&#1090;&#1100;). &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072; &#1080;&#1075;&#1088;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1072;&#1093; &#1096;&#1072;&#1096;&#1077;&#1082;:</p><p>&#1042;&#1089;&#1077; &#1096;&#1072;&#1096;&#1082;&#1080;, &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1074; &#1087;&#1072;&#1088;&#1090;&#1080;&#1080;, &#1074;&#1099;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086;&#1084; &#1080;&#1075;&#1088;&#1099; &#1085;&#1072; &#1076;&#1086;&#1089;&#1082;&#1091;. &#1044;&#1072;&#1083;&#1077;&#1077; &#1086;&#1085;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1074;&#1080;&#1075;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086; &#1087;&#1086;&#1083;&#1103;&#1084; &#1076;&#1086;&#1089;&#1082;&#1080; &#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1085;&#1103;&#1090;&#1099; &#1089; &#1085;&#1077;&#1105; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1073;&#1086;&#1103; &#1096;&#1072;&#1096;&#1082;&#1086;&#1081; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1080;&#1082;&#1072;.</p><p>&#1041;&#1088;&#1072;&#1090;&#1100; &#1096;&#1072;&#1096;&#1082;&#1091;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1091;&#1102;&#1089;&#1103; &#1087;&#1086;&#1076; &#1073;&#1086;&#1077;&#1084;, &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;.</p><p>&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1074;&#1072; &#1074;&#1080;&#1076;&#1072; &#1096;&#1072;&#1096;&#1077;&#1082;: &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1077; &#1080; &#1076;&#1072;&#1084;&#1082;&#1080;. &#1042; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1087;&#1072;&#1088;&#1090;&#1080;&#1080; &#1074;&#1089;&#1077; &#1096;&#1072;&#1096;&#1082;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1077;. &#1055;&#1088;&#1086;&#1089;&#1090;&#1072;&#1103; &#1096;&#1072;&#1096;&#1082;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1076;&#1072;&#1084;&#1082;&#1091;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1072; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1085;&#1077;&#1090; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1086;&#1075;&#1086; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1088;&#1103;&#1076;&#1072; &#1076;&#1086;&#1089;&#1082;&#1080; (&#1076;&#1072;&#1084;&#1086;&#1095;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1103;).</p><p>&#1055;&#1088;&#1086;&#1089;&#1090;&#1099;&#1077; &#1096;&#1072;&#1096;&#1082;&#1080; &#1093;&#1086;&#1076;&#1103;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1087;&#1077;&#1088;&#1105;&#1076; &#1085;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1077; &#1087;&#1086;&#1083;&#1077;. &#1044;&#1072;&#1084;&#1082;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1080; &#1074;&#1087;&#1077;&#1088;&#1105;&#1076; &#1080; &#1085;&#1072;&#1079;&#1072;&#1076;.</p></div></div><div class="chapter"><div class="titlepage"><div><div><h2 class="title"><a name="d5e25"></a>Chapter&nbsp;2.&nbsp;Realization details</h2></div></div></div><div class="toc"><p><b>Table of Contents</b></p><dl class="toc"><dt><span class="section"><a href="#d5e27">Code win game</a></span></dt><dt><span class="section"><a href="#d5e30">Init after load page.</a></span></dt></dl></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e27"></a>Code win game</h2></div></div></div><pre class="programlisting">
	               function checkIfLost(){
	               var i;
	               for(i = 1 ; i &lt;= 12; i++)
	                   if(the_checker[i].alive)
	                       return false;
	                   return true;
	                }
	                </pre></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e30"></a>Init after load page.</h2></div></div></div><pre class="programlisting">
	                   var square_p = function(square,index){
                        	this.id = square;
                        	this.ocupied = false;
                        	this.pieceId = undefined;
                        	this.id.onclick = function() {
                        		makeMove(index);
                        	}
                        }
                        var checker = function(piece,color,square) {
                        	this.id = piece;
                        	this.color = color;
                        	this.king = false;
                        	this.ocupied_square = square;
                        	this.alive = true;
                        	this.attack = false;
                        	if(square%8){
                        		this.coordX= square%8;
                        		this.coordY = Math.floor(square/8) + 1 ;
                        	}
                        	else{
                        		this.coordX = 8;
                        		this.coordY = square/8 ;
                        	}
                        	this.id.onclick = function  () {
                        		showMoves(piece);	
                        	}
                        }
	                </pre></div></div></div></div></body></html>